app/controllers/problems_controller.rb

  def index
    @problems = Problem.all
---
SELECT * FROM "problems"